Epoch 00067: early stopping
train rmse = 1.3347, test rmse = 1.3715
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 512)               7168      
_________________________________________________________________
dense_1 (Dense)              (None, 256)               131328    
_________________________________________________________________
dense_2 (Dense)              (None, 64)                16448     
_________________________________________________________________
dense_3 (Dense)              (None, 16)                1040      
_________________________________________________________________
dense_4 (Dense)              (None, 2)                 34        
=================================================================
Total params: 156,018
Trainable params: 156,018
Non-trainable params: 0
_________________________________________________________________
None
saved!
rmse dl = 1.9083
rmse crlb = 0.7702
rmse nr-ls = 10.0421
rmse nr-ss = 8.4519
rmse nrna-ls = 1.5409
rmse nrna-wls = 1.4787
rmse nr1a-ls = 14.3120
rmse nr1a-ss = 2.8514
rmse nr1a-minls = 3.6576