Epoch 00084: early stopping
train rmse = 1.1180, test rmse = 1.1704
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 512)               10240     
_________________________________________________________________
dense_1 (Dense)              (None, 256)               131328    
_________________________________________________________________
dense_2 (Dense)              (None, 64)                16448     
_________________________________________________________________
dense_3 (Dense)              (None, 16)                1040      
_________________________________________________________________
dense_4 (Dense)              (None, 2)                 34        
=================================================================
Total params: 159,090
Trainable params: 159,090
Non-trainable params: 0
_________________________________________________________________
None
saved!
rmse dl = 2.0788
rmse crlb = 0.5694
rmse nr-ls = 4.4931
rmse nr-ss = 3.1437
rmse nrna-ls = 1.2510
rmse nrna-wls = 1.2173
rmse nr1a-ls = 10.7287
rmse nr1a-ss = 2.4289
rmse nr1a-minls = 2.9097