Epoch 00061: early stopping
train rmse = 1.4498, test rmse = 1.4814
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 512)               5632      
_________________________________________________________________
dense_1 (Dense)              (None, 256)               131328    
_________________________________________________________________
dense_2 (Dense)              (None, 64)                16448     
_________________________________________________________________
dense_3 (Dense)              (None, 16)                1040      
_________________________________________________________________
dense_4 (Dense)              (None, 2)                 34        
=================================================================
Total params: 154,482
Trainable params: 154,482
Non-trainable params: 0
_________________________________________________________________
None
saved!
rmse dl = 2.0670
rmse crlb = 0.9691
rmse nr-ls = 91.0274
rmse nr-ss = 228.9597
rmse nrna-ls = 1.7847
rmse nrna-wls = 1.6937
rmse nr1a-ls = 18.4011
rmse nr1a-ss = 3.1231
rmse nr1a-minls = 4.3002